RhinoInside.Revit API Documentation
GeometryDecoder.ToTransform Method
 Converts the specified Plane to an equivalent Rhino Transform.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8016
Syntax
public static Transform ToTransform(
	this Transform value
)
Parameters
value
Type: Transform
A value to convert.
Return Value
Type: Transform
A Rhino Transform that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Transform. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace